---
title: MassFailures
classe: Autodesk.Revit.DB.BuiltInFailures+MassFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 29
---

# MassFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AutoGlazingFailed { get; }` | `MassFailures.AutoGlazingFailed` | FailureDefinitionId |
| `FailureDefinitionId AutoGlazingFailedError { get; }` | `MassFailures.AutoGlazingFailedError` | FailureDefinitionId |
| `FailureDefinitionId BooleanUnionFailed { get; }` | `MassFailures.BooleanUnionFailed` | FailureDefinitionId |
| `FailureDefinitionId CannotIntegrate { get; }` | `MassFailures.CannotIntegrate` | FailureDefinitionId |
| `FailureDefinitionId CannotMergeGeometry { get; }` | `MassFailures.CannotMergeGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveMassing { get; }` | `MassFailures.CannotMoveMassing` | FailureDefinitionId |
| `FailureDefinitionId CreateCoreGeometryFailed { get; }` | `MassFailures.CreateCoreGeometryFailed` | FailureDefinitionId |
| `FailureDefinitionId DividePerimeterZoneFailed { get; }` | `MassFailures.DividePerimeterZoneFailed` | FailureDefinitionId |
| `FailureDefinitionId FaceRegionCreationFailed { get; }` | `MassFailures.FaceRegionCreationFailed` | FailureDefinitionId |
| `FailureDefinitionId FaceSplitFailed { get; }` | `MassFailures.FaceSplitFailed` | FailureDefinitionId |
| `FailureDefinitionId FloorAreaFaceFailed { get; }` | `MassFailures.FloorAreaFaceFailed` | FailureDefinitionId |
| `FailureDefinitionId FloorMightLookWrong { get; }` | `MassFailures.FloorMightLookWrong` | FailureDefinitionId |
| `FailureDefinitionId FloorRecreateFailed { get; }` | `MassFailures.FloorRecreateFailed` | FailureDefinitionId |
| `FailureDefinitionId FloorRecreateFailedWarning { get; }` | `MassFailures.FloorRecreateFailedWarning` | FailureDefinitionId |
| `FailureDefinitionId MinSkylightWidthImperial { get; }` | `MassFailures.MinSkylightWidthImperial` | FailureDefinitionId |
| `FailureDefinitionId MinSkylightWidthMetric { get; }` | `MassFailures.MinSkylightWidthMetric` | FailureDefinitionId |
| `FailureDefinitionId MultipleMassing { get; }` | `MassFailures.MultipleMassing` | FailureDefinitionId |
| `FailureDefinitionId NoCurtainRoofsInMassing { get; }` | `MassFailures.NoCurtainRoofsInMassing` | FailureDefinitionId |
| `FailureDefinitionId NonOccupiableMassZone { get; }` | `MassFailures.NonOccupiableMassZone` | FailureDefinitionId |
| `FailureDefinitionId NoSolidInMass { get; }` | `MassFailures.NoSolidInMass` | FailureDefinitionId |
| `FailureDefinitionId OpenAndSolidGeometry { get; }` | `MassFailures.OpenAndSolidGeometry` | FailureDefinitionId |
| `FailureDefinitionId OpenGeometryOnly { get; }` | `MassFailures.OpenGeometryOnly` | FailureDefinitionId |
| `FailureDefinitionId OverlappingSolids { get; }` | `MassFailures.OverlappingSolids` | FailureDefinitionId |
| `FailureDefinitionId SketchCurveNotModelable { get; }` | `MassFailures.SketchCurveNotModelable` | FailureDefinitionId |
| `FailureDefinitionId SplitFacesByGroundPlaneCrashed { get; }` | `MassFailures.SplitFacesByGroundPlaneCrashed` | FailureDefinitionId |
| `FailureDefinitionId SplitFacesByGroundPlaneFailed { get; }` | `MassFailures.SplitFacesByGroundPlaneFailed` | FailureDefinitionId |
| `FailureDefinitionId SplitOverlappingFacesFailed { get; }` | `MassFailures.SplitOverlappingFacesFailed` | FailureDefinitionId |
| `FailureDefinitionId TooManyGeometries { get; }` | `MassFailures.TooManyGeometries` | FailureDefinitionId |
| `FailureDefinitionId UpgradedMassingWarning { get; }` | `MassFailures.UpgradedMassingWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```